/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   bsp.cpp                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: azinchen <azinchen@student.hive.fi>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/06/16 23:50:38 by azinchen          #+#    #+#             */
/*   Updated: 2025/06/16 23:50:40 by azinchen         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Point.hpp"

/*
BSP разбивает пространство на части при помощи плоскостей (в 3D) или линий (в 2D).
Этот процесс происходит рекурсивно — пространство делится на две части, затем 
каждая часть снова делится, и так далее. В итоге строится BSP-дерево.


*/

bool bsp( Point const a, Point const b, Point const c, Point const point)
{
	
}